src/Catalogs/кс_Сценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>кс_Сценарии</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеглЗаданияИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеглЗаданияАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Скрипты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Скрипт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗД_Скрипты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Параметр</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПараметрЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.зд_ТипПараметра</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/зд_ТипПараметра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>зд_ТипПараметра</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выражение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/кс_Сценарии/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТЧ_СкриптыПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТЧ_Параметр.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки",Элементы.ТЧ_Скрипты.ТекущиеДанные.КлючСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СкриптыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.КлючСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьПараметрамиСкрипта(Скрипт,КлючСтроки);
	
	Выборка_Параметры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Скрипт,"ТЧ_Параметр").Выбрать();	
	
	Пока Выборка_Параметры.следующий() Цикл
		НС = Объект.ТЧ_Параметр.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Выборка_Параметры,,"НомерСтроки");
		НС.КлючСтроки = КлючСтроки;
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СкриптыСкриптПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТЧ_Скрипты.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда	
		ЗаполнитьПараметрамиСкрипта(ТекДанные.Скрипт,ТекДанные.КлючСтроки);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТЧ_ПараметрПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока и Элементы.ТЧ_Скрипты.ТекущиеДанные = Неопределено Тогда
		ВызватьИсключение ("Укажите строку сценария для параметра");
	КонецЕсли; 
	
	Если НоваяСтрока Тогда
       Элемент.ТекущиеДанные.КлючСтроки = Элементы.ТЧ_Скрипты.ТекущиеДанные.КлючСтроки; 
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура РеглЗаданияАктивностьПриИзменении(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(НастройкиРЗ) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		НастройкиРЗ = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("ИзменитьРегламентноеЗаданиеЗавершение", ЭтотОбъект);
	
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(НастройкиРЗ);
	РедактированиеРасписания.Показать(Обработчик);

	
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьРегламентноеЗаданиеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиРЗ = Расписание;
	СостояниеРЗ = Строка(Расписание);
	
	ОформитьРегЗадание();
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаСервере
Процедура ОформитьРегЗадание()
		
	РеглЗадание = "не указано";
	Если Объект.РеглЗаданияАктивность и 
		ЗначениеЗаполнено(Объект.РеглЗаданияИдентификатор) и НастройкиРЗ = Неопределено Тогда
		РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Объект.РеглЗаданияИдентификатор);
		РеглЗадание = РЗ.Расписание;
		НастройкиРЗ = РЗ.Расписание;
	ИначеЕсли НастройкиРЗ<>Неопределено Тогда
		РеглЗадание = ""+НастройкиРЗ;					
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОформитьРегЗадание();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НастройкиРЗ", НастройкиРЗ);
КонецПроцедуры


#Область работа_с_параметрами

&НаКлиенте
Процедура ТЧ_ПараметрПараметрЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	
	СтрокаПараметр = Элементы.ТЧ_Параметр.ТекущиеДанные;
	ИмяПараметра = СтрокаПараметр.Наименование;
	ТипПараметра = СтрокаПараметр.ТипПараметр;
	ЗначениеПараметра = СтрокаПараметр.ПараметрЗначение; 
	
	ДополнительныеПараметры = Новый Структура;
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ВводЗначенияПараметраЗавершен", ЭтотОбъект, ДополнительныеПараметры);
	//ВводЗначенияПараметраВФорме(ЗаголовокПараметр, Элемент, ЗначениеПараметра, СтрокаПараметр.ТипЗначения, СтандартнаяОбработка, ОписаниеОповещенияЗавершение);
	
	ДополнительныеПараметры = Новый Структура("Имя", ИмяПараметра);
	Если ТипПараметра = ПредопределенноеЗначение("Перечисление.зд_ТипПараметра.Выражение") Тогда
		
		СтандартнаяОбработка = Ложь;
		ДополнительныеПараметры.Вставить("ВидСложногоПараметра", ТипПараметра);
		ДополнительныеПараметры.Вставить("СтрокаПараметр", СтрокаПараметр);
		
		ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("РедактированиеСложногоПараметраЗавершено", ЭтотОбъект, ДополнительныеПараметры);
		
		ДополнениеЗаголовка = СтрШаблон("(%1): %2", "ru", ИмяПараметра);
		ОткрытьРедактированиеВыражения(ДополнениеЗаголовка, "Перечисление.УКО_РежимРедактированияВыражения.Параметр", ЗначениеПараметра, ЭтаФорма, ОписаниеОповещенияЗавершение);
	
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ВводЗначенияПараметраВФорме(Заголовок, Элемент, Значение, ОписаниеТипов, СтандартнаяОбработка, ОписаниеОповещенияЗавершение, РедактированиеСписка = Ложь) Экспорт
	
	Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	//ПроверяемоеЗначение = УКО_ФормыКлиент_ПроверяемоеЗначениеПараметра(Значение, ОписаниеТипов);
	//
	//Если ТипЗнч(ПроверяемоеЗначение) = Тип("Тип") Тогда
	//	
	//	ДополнительныеПараметры = Новый Структура;
	//	ДополнительныеПараметры.Вставить("Заголовок", Заголовок);
	//	УКО_ФормыКлиент_ОткрытьРедактированиеТипаЗначения(Элемент, "Перечисление.УКО_РежимРедактированияТипаЗначения.РедактированиеТипа",
	//										Значение, ОписаниеОповещенияЗавершение, ДополнительныеПараметры);

	//ИначеЕсли ТипЗнч(ПроверяемоеЗначение) = Тип("УникальныйИдентификатор") Тогда
	//	
	//	УКО_ФормыКлиент_ОткрытьРедактированиеУникальногоИдентификатора(Заголовок, Значение, Элемент, ОписаниеОповещенияЗавершение);
	//	
	//ИначеЕсли Элемент.ВыбиратьТип Тогда
	//	
	//	СтандартнаяОбработка = Ложь;
	//	
	//	ДополнительныеПараметры = Новый Структура;
	//	ДополнительныеПараметры.Вставить("Заголовок", Заголовок);
	//	Если РедактированиеСписка Тогда
	//		ДополнительныеПараметры.Вставить("ИсключаемыеТипы", "Граница,МоментВремени");
	//	КонецЕсли;
	//	
	//	УКО_ФормыКлиент_ОткрытьРедактированиеТипаЗначения(Элемент, "Перечисление.УКО_РежимРедактированияТипаЗначения.ВыборТипа",
	//										ОписаниеТипов, ОписаниеОповещенияЗавершение, ДополнительныеПараметры);
	//	
	//КонецЕсли;

КонецПроцедуры


&НаКлиенте
// Открывает форму редактирования выражения
//
// Параметры:
//	Заголовок - Строка - Дополнительный заголовок формы
//	Режим - РежимРедактированияВыражения - Режим редактирования выражения
//	Выражение - Строка - Выражение
//	ФормаВладелец - Форма - Форма владелец
//	ОписаниеОповещенияЗавершение - ОписаниеОповещения - Описание оповещения при завершении
//
Процедура ОткрытьРедактированиеВыражения(Заголовок, Режим, Выражение, ФормаВладелец, ОписаниеОповещенияЗавершение) Экспорт
	
	ПараметрыФормы = Новый Структура("Заголовок, Режим, Выражение", Заголовок, Режим, Выражение);
	ОткрытьДополнительную("РедактированиеВыражения", ПараметрыФормы, ФормаВладелец,, ОписаниеОповещенияЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДополнительную(Имя, Параметры = Неопределено, Владелец = Неопределено, Уникальность = Неопределено, ОписаниеОповещенияОЗакрытии = Неопределено) Экспорт
	
	ОбъектФорм = "ОбщаяФорма";

	
	
	ПолноеИмяФормы = СтрШаблон("%1.%2%3", ОбъектФорм, "зд", Имя);
	
	Если Владелец = Неопределено Тогда
		РежимОткрытия = Неопределено;
	Иначе 
		РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	ОткрытьФорму(ПолноеИмяФормы, Параметры, Владелец, Уникальность,,,ОписаниеОповещенияОЗакрытии, РежимОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводЗначенияПараметраЗавершен(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	//Если ДополнительныеПараметры.Свойство("ВыборТипа") Тогда
	//	
	//	ЭлементЗначениеПараметра = Элементы.ПараметрыЗапроса.ТекущийЭлемент;
	//	ЭлементЗначениеПараметра.ОграничениеТипа = Результат;
	//	ЭлементЗначениеПараметра.ВыбиратьТип = Ложь;
	//	
	//	НовоеЗначение = Результат.ПривестиЗначение(Неопределено);
	//	
	//Иначе
	//	
	//	НовоеЗначение = Результат;
	//	
	//КонецЕсли;
	//
	//ПараметрЗапросаТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	//ИмяПараметра = ПараметрЗапросаТекущиеДанные.Имя;
	//УКО_ДанныеКлиент_ВставитьЗначениеПараметраЗапроса(ЭтаФорма, ТекущаяСтрока, ИмяПараметра, НовоеЗначение);
	//ОбновитьСтрокуПараметра(ПараметрЗапросаТекущиеДанные, ИмяПараметра, ПараметрЗапросаТекущиеДанные.ТипЗначения, НовоеЗначение);
	
КонецПроцедуры


&НаКлиенте
Процедура РедактированиеСложногоПараметраЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Модифицированность = Истина;
	
	ИмяПараметра = ДополнительныеПараметры.Имя;
	НовоеЗначение = УКО_ЗапросКлиентСервер_ЗначениеСложногоПараметра(ДополнительныеПараметры.ВидСложногоПараметра, Результат);
	
	//УКО_ДанныеКлиент_ВставитьЗначениеПараметраЗапроса(ЭтаФорма, ТекущаяСтрока, ИмяПараметра, НовоеЗначение);
	
	ДополнительныеПараметры.СтрокаПараметр.ПараметрЗначение = Результат; 
	
	//ОбновитьСтрокуПараметра(ПараметрЗапросаТекущиеДанные, ИмяПараметра, ПараметрЗапросаТекущиеДанные.ТипЗначения, НовоеЗначение);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Новое значение сложного параметра
//
// Параметры:
//   Вид - Перечисление.УКО_СложныйПараметрЗапроса - Вид
//   Значение - Произвольный - Значение
//   Представление - Строка - Представление
//
// Возвращаемое значение:
//   Структура - Данные сложного параметра
//
Функция УКО_ЗапросКлиентСервер_ЗначениеСложногоПараметра(Вид, Значение, Представление = "") Экспорт
	
	Если Вид = "Перечисление.УКО_СложныйПараметрЗапроса.Выражение" Тогда
		
		Представление = УКО_СтрокиКлиентСервер_Сокращенно(Значение, 70);
		
	ИначеЕсли Вид = "Перечисление.УКО_СложныйПараметрЗапроса.ТаблицаЗначений" Тогда
		
		Представление = НСтр("ru = '<Таблица значений>'; en = '<Table of values>'");
		
	ИначеЕсли Вид = "Перечисление.УКО_СложныйПараметрЗапроса.Граница" Тогда
		
		Если Значение.Вид = "Перечисление.УКО_ВидГраницы.Включая" Тогда
			ВидПредставление = НСтр("ru = 'Включая'; en = 'Including'");
		ИначеЕсли Значение.Вид = "Перечисление.УКО_ВидГраницы.Исключая" Тогда
			ВидПредставление = НСтр("ru = 'Исключая'; en = 'Excluding'");
		КонецЕсли;
		
		Представление = СтрШаблон("%1; %2", ВидПредставление, Значение.Значение);
		
	КонецЕсли;
	
	Возврат Новый Структура("Вид, Значение, Представление", Вид, Значение, Представление);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Форматирует текст укорачивая до заданной длины
//
// Параметры:
//   Текст - Строка - Текст
//   Количество - Число - Количество символов
//   Многострочная - Булево - Многострочное использование
//
// Возвращаемое значение:
//   Строка - Отформатированный текст
//
Функция УКО_СтрокиКлиентСервер_Сокращенно(Текст, Количество, Многострочная = Ложь) Экспорт
	
	ТекстМногострочный = УКО_СтрокиКлиентСервер_МногострочнаяСтрока(Текст);
	
	Если ТекстМногострочный
		И НЕ Многострочная Тогда
		
		ПерваяСтрока = СтрПолучитьСтроку(Текст, 1);
		Результат = УКО_СтрокиКлиентСервер_Сократить(ПерваяСтрока, Количество, Истина);
		
	Иначе
		
		Результат = УКО_СтрокиКлиентСервер_Сократить(Текст, Количество);
		
	КонецЕсли;
	
	Возврат Результат;
	
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
// Проверяет строка многострочная?
//
// Параметры:
//   Строка - Строка - Проверяемая строка
//
// Возвращаемое значение:
//   Булево - Истина, если строка многострочная
//
Функция УКО_СтрокиКлиентСервер_МногострочнаяСтрока(Строка) Экспорт
	
	Возврат Булево(СтрНайти(Строка, Символы.ПС));
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
// Сокращает текст до N символов
//
// Параметры:
//   Текст - Строка - Текст
//   Количество - Число - Количество символов
//   ВсегдаДобавлятьЗавершение - Булево - Всегда добавлять завершающий символы ...
//
// Возвращаемое значение:
//   Строка - Сокращенная строка
//
Функция УКО_СтрокиКлиентСервер_Сократить(Текст, Количество, ВсегдаДобавлятьЗавершение = Ложь) Экспорт
	
	Завершение = "...";
	НормальнаяДлина = Количество - СтрДлина(Завершение);
	
	Длина = СтрДлина(Текст);
	Если Длина > НормальнаяДлина Тогда
		
		Результат = Лев(Текст, НормальнаяДлина) + Завершение;
		
	Иначе
		
		Результат = Текст;
		Если ВсегдаДобавлятьЗавершение Тогда
			Результат = Результат + Завершение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
// Изменяет поля данных
//
// Параметры:
//  Форма - Форма - Форма
//  Строка - Строка - Строка 
//  Имя - Строка - Имя параметра
//  Значение - Произвольный - Устанавливаемое значение параметра
//
Процедура УКО_ДанныеКлиент_ВставитьЗначениеПараметраЗапроса(Форма, Строка, Имя, Значение) Экспорт
	
	//Данные = УКО_ДанныеКлиент_Получить(Форма, Строка);
	//Данные.ЗначенияПараметров.Вставить(Имя, Значение);
	Форма.Модифицированность = Истина;
	
	//Если Форма.ТекущаяСтрока.UID = Форма.ТекущийРезультат.АктуаленПоСтроке Тогда
	//	Форма.ТекущийРезультат.АктуаленПоСтроке = Неопределено;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Вставляет внешний источник
//
// Параметры:
//  Форма - Форма - Форма
//  Строка - Строка - Строка 
//  UID - УникальныйИдентификатор - UID внешнего источника
//  Описание - Структура - Описание внешнего источника
//
Процедура УКО_ДанныеКлиент_ВставитьВнешнийИсточник(Форма, Строка, UID, Описание) Экспорт
	
	//Данные = УКО_ДанныеКлиент_Получить(Форма, Строка);
	//Форма.Модифицированность = Истина;
	//
	//Данные.ВнешниеИсточники.Вставить(UID, Описание);	

КонецПроцедуры



#КонецОбласти
